[
    "Why should you avoid the duck psychologist? He's a quack.",
    "What do cows do in their spare time? Go to the moooovies.",
    "Why do birds hate Instagram? They prefer to tweet.",
    "Why do birds hate Instagram? They prefer to tweet.",
    "Why did the sheep get detention? It was baaaaaad.",
    "Why couldn't the horse congress pass any bills? They all kept voting naaaaaay.",
    "Did you hear about the crook who stole a calendar? He got twelve months.",
    "Q. What’s the difference between ignorance and apathy? A. I don’t know and I don’t care.",
    "Did you hear about the semi-colon that broke the law? He was given two consecutive sentences.",
    "Never criticize someone until you’ve walked a mile in their shoes. That way, when you criticize them, they won’t be able to hear you from that far away. Plus, you’ll have their shoes.",
    "The world tongue-twister champion just got arrested. I hear they’re gonna give him a really tough sentence.",
    "I own the world’s worst thesaurus. Not only is it awful, it’s awful.",
    "So what if I don’t know what “Armageddon” means? It’s not the end of the world.",
    "Correct punctuation: the difference between a sentence that’s well-written and a sentence that’s, well, written. (Credit: justbadpuns.com)",
    "What’s the difference between a good joke and a bad joke timing.",
    "I woke up this morning and forgot which side the sun rises from, then it dawned on me.",
    "I’ve just written a song about tortillas; actually, it’s more of a rap.",
    "Velcro – what a rip-off!",
    "I recently decided to sell my vacuum cleaner as all it was doing was gathering dust.",
    "Don’t you hate it when someone answers their own questions? I do.",
    "I hate Russian dolls, they’re so full of themselves.",
    "250 lbs here on Earth is 94.5 lbs on Mercury. No, I’m not fat. I’m just not on the right planet.",
    "The best thing about good old days is that we were neither good nor old.",
    "I have clean conscience. I haven’t used it once till now.",
    "If we shouldn’t eat at night, why do they put a light in the fridge?",
    "Do I lose when the police officer says papers and I say scissors?",
    "If I got 50 cents for every failed math exam, I’d have $ 6.30 now.",
    "A pig stands in front of an electric socket: “Oh no, who put you into that wall?!”",
    "Meanwhile in a parallel universe: “Oh for God’s sake! Where are all these extra single socks coming from?!”",
    "Moses had the first tablet that could connect to the cloud.",
    "“Um.” —First horse that got ridden  ",
    "A lot of people cry when they cut onions. The trick is not to form an emotional bond.",
    "I wrote a song about a tortilla. Well actually, it’s more of a wrap.",
    "Some people just have a way with words, and other people … oh … not have way. Steve Martin",
    "The four most beautiful words in our common language:  I told you so. Gore Vidal",
    "All pro athletes are  bilingual. They speak English and profanity. Gordie Howe, hockey player",
    "I don’t want to brag, but I do speak pig Latin; I mean, I’m not fluent, but I’m sure  if I ever went there, I could get by.",
    "I bought one of those tapes to teach you Spanish in your sleep. During the night, the tape skipped. Now I can only stutter in Spanish. Steven Wright",
    "My girlfriend and I often laugh about how competitive we are. But I laugh more.",
    "When I was growing up, my mother’s best dish was store-bought Entenmann’s chocolate chip cookies. —Michael Ian Black, from Navel Gazing (Gallery Books)",
    "“Next time I send a damn fool, I go myself.” —Sgt. Louis Cukela, reportedly said at the Battle of Belleau Wood during World War I",
    "Probably the worst thing you can hear when you’re wearing a bikini is “Good for you!” ",
    "When I lost my rifle, the Army charged me $85. That’s why in the Navy, the captain goes down with the ship. Comedian Dick Gregory",
    "A conference call is the best way for a dozen people to say “bye” 300 times. ",
    "The Revenant (2015).  An epic tale of one man’s desperate journey to  do whatever it takes to  finally win an Oscar.",
    "Luke Skywalker is my favorite hero that looks 100 percent prepared to figure skate at all times."
 ]